cavity/InletVel/vel=0.3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          43;
        startFace       1690;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          938;
        startFace       1733;
    }
    right
    {
        type            patch;
        nFaces          25;
        startFace       2671;
    }
    left
    {
        type            patch;
        nFaces          20;
        startFace       2696;
    }
    model
    {
        type            wall;
        inGroups        List<word> 
2
(
modelGroup
wall
)
;
        nFaces          160;
        startFace       2716;
    }
)

// ************************************************************************* //
